dont-be-evil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-19 Sat 00:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Don't be evil</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Huy Tran" />
<link rel="stylesheet" type="text/css" href="css/hack.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Don't be evil</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org25e86fa">1. OK, but why?</a></li>
<li><a href="#org0727db7">2. I'm convinced, now show me how?</a>
<ul>
<li><a href="#orgffcef4c">2.1. First step: Comment out every <code>evil</code> related packages.</a></li>
<li><a href="#org6a3ef3c">2.2. Second step: Learn the basic movement.</a></li>
<li><a href="#org573d16d">2.3. Third step: Learn the basic functions.</a></li>
<li><a href="#org7439438">2.4. Fourth step: Custom some keybinding</a></li>
</ul>
</li>
<li><a href="#org9ef86a1">3. Conclusion</a></li>
</ul>
</div>
</div>
<p>
This note is not about <a href="https://en.m.wikipedia.org/wiki/Don't_be_evil">Google's motto</a>. This is a note about <b>moving away from evil-mode</b>.
</p>

<div id="outline-container-org25e86fa" class="outline-2">
<h2 id="org25e86fa"><span class="section-number-2">1</span> OK, but why?</h2>
<div class="outline-text-2" id="text-1">
<p>
Because <code>evil-mode</code> messed up the keybinding of so many packages I'm using (magit, neotree, org-mode agenda,&#x2026;). I know there's a package to make these packages working nicely with <code>evil</code>, but eventually, these packages are not designed to work with <code>evil</code> in the first place.
</p>

<p>
Another reason, is that sticking with <code>evil-mode</code> make me feel I'm not really into Emacs, it's holding me back from exploring the real Emacs. So, if it's not <code>org-mode</code> that hold me back, I can just go back and use Vim instead.
</p>
</div>
</div>

<div id="outline-container-org0727db7" class="outline-2">
<h2 id="org0727db7"><span class="section-number-2">2</span> I'm convinced, now show me how?</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgffcef4c" class="outline-3">
<h3 id="orgffcef4c"><span class="section-number-3">2.1</span> First step: Comment out every <code>evil</code> related packages.</h3>
<div class="outline-text-3" id="text-2-1">
<p>
And restart Emacs as well.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #9ca0a4;">;;;; </span><span style="color: #9ca0a4;">Vim mode</span>
<span style="color: #9ca0a4;">;;</span><span style="color: #9ca0a4;">(use-package evil</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:ensure t</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:config</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(evil-mode 1)</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(evil-set-initial-state 'term-mode 'emacs))</span>

<span style="color: #9ca0a4;">;;</span><span style="color: #9ca0a4;">(use-package evil-escape</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:ensure t</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:init</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(setq-default evil-escape-key-sequence "jk")</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:config</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(evil-escape-mode 1))</span>

<span style="color: #9ca0a4;">;;;; </span><span style="color: #9ca0a4;">Matchit</span>
<span style="color: #9ca0a4;">;;</span><span style="color: #9ca0a4;">(use-package evil-matchit</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:ensure t</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:init</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(global-evil-matchit-mode 1))</span>

<span style="color: #9ca0a4;">;;;; </span><span style="color: #9ca0a4;">Evil surround</span>
<span style="color: #9ca0a4;">;;</span><span style="color: #9ca0a4;">(use-package evil-surround</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:ensure t</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">:config</span>
<span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">(global-evil-surround-mode 1))</span>
</pre>
</div>

<p>
Next, we'll learn some basic, mostly what written here is my concerns as a Vim/Evil user moving to Emacs, trying to find the equivalent key.
</p>
</div>
</div>

<div id="outline-container-org6a3ef3c" class="outline-3">
<h3 id="org6a3ef3c"><span class="section-number-3">2.2</span> Second step: Learn the basic movement.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
So, in <code>evil-mode</code>, we move around with <code>hjkl</code>, but before that, we need to press <code>esc</code> or in my case <code>jk</code> to switch from <code>insert</code> mode to <code>normal</code> mode.
</p>

<p>
Without <code>evil-mode</code>, we don't have modal editing, no more mode switching, we're in <code>insert</code> mode all the time, so you can just type whenever you want, but if you want to move around:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Emacs Key</b></td>
<td class="org-left"><b>Description</b></td>
<td class="org-left"><b>Evil Equivalent</b></td>
</tr>

<tr>
<td class="org-left">C-n, C-p</td>
<td class="org-left">Move to the next/previous line</td>
<td class="org-left">j/k</td>
</tr>

<tr>
<td class="org-left">C-f, C-b</td>
<td class="org-left">Move forward/backward in a line</td>
<td class="org-left">h/l</td>
</tr>

<tr>
<td class="org-left">C-e, C-a</td>
<td class="org-left">Move to the end/begin of the line</td>
<td class="org-left">$/0</td>
</tr>

<tr>
<td class="org-left">M-f, M-b</td>
<td class="org-left">Jump to next/previous word</td>
<td class="org-left">w/b</td>
</tr>

<tr>
<td class="org-left">M-&gt;, M-&lt;</td>
<td class="org-left">Move to the end/begin of the buffer</td>
<td class="org-left">G/gg</td>
</tr>
</tbody>
</table>

<p>
It should not take you more than 15 minutes to getting used to the new keybindings.
</p>
</div>
</div>

<div id="outline-container-org573d16d" class="outline-3">
<h3 id="org573d16d"><span class="section-number-3">2.3</span> Third step: Learn the basic functions.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Next, we'll see what's the Emacs equivalent of Vim keybinding for basic functionalities like searching, selecting, copy, paste.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Emacs Key</b></td>
<td class="org-left"><b>Description</b></td>
<td class="org-left"><b>Evil Equivalent</b></td>
</tr>

<tr>
<td class="org-left">C-x u or C-/</td>
<td class="org-left">Undo</td>
<td class="org-left">u</td>
</tr>

<tr>
<td class="org-left">C-SPC</td>
<td class="org-left">Start selecting</td>
<td class="org-left">v</td>
</tr>

<tr>
<td class="org-left">C-x SPC</td>
<td class="org-left">Rectangle selecting</td>
<td class="org-left">C-v</td>
</tr>

<tr>
<td class="org-left">C-w</td>
<td class="org-left">Cut after select</td>
<td class="org-left">x</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">Copy after select</td>
<td class="org-left">y</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">Paste</td>
<td class="org-left">p</td>
</tr>

<tr>
<td class="org-left">C-s</td>
<td class="org-left">Search in a buffer</td>
<td class="org-left">/</td>
</tr>

<tr>
<td class="org-left">C-s C-s</td>
<td class="org-left">Search next</td>
<td class="org-left">n</td>
</tr>

<tr>
<td class="org-left">C-SPC C-x r t</td>
<td class="org-left">Select and replace</td>
<td class="org-left">cw or dw</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">Delete to the end of line</td>
<td class="org-left">Shift D</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">Delete a word</td>
<td class="org-left">dw</td>
</tr>

<tr>
<td class="org-left">C-j</td>
<td class="org-left">Move the content behind pointer to new line</td>
<td class="org-left">Dunno, never use</td>
</tr>

<tr>
<td class="org-left">C-e C-j</td>
<td class="org-left">Jump to the end and add a new line</td>
<td class="org-left">o</td>
</tr>

<tr>
<td class="org-left">C-a C-k</td>
<td class="org-left">Jump to the beginning and delete the whole line</td>
<td class="org-left">dd</td>
</tr>

<tr>
<td class="org-left">C-S-backspace</td>
<td class="org-left">Delete the whole line</td>
<td class="org-left">dd</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">Save the current buffer</td>
<td class="org-left">:w</td>
</tr>

<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">Open a new file</td>
<td class="org-left">:e</td>
</tr>

<tr>
<td class="org-left">C-g</td>
<td class="org-left">Escape, canceling the current action</td>
<td class="org-left">Esc</td>
</tr>
</tbody>
</table>

<p>
At this point, we should take a break from the exploring and start using Emacs with these keybinding for a day or so, to get yourself being used with the changes.
</p>

<p>
For functions that you don't know, just start typing <code>M-x</code>, type some words and press <code>tab</code> to see the suggestion list, use it from here instead of your <code>evil</code> keybindings. There's no need to hurry.
</p>
</div>
</div>

<div id="outline-container-org7439438" class="outline-3">
<h3 id="org7439438"><span class="section-number-3">2.4</span> Fourth step: Custom some keybinding</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Now, it's time to take the control of Emacs and make it your. Before making the move to vanilla Emacs, I'm using <code>general</code> mode to make some custom keybinding. Now we can't use it, but we can just map the key directly using <code>global-set-key</code>.
</p>

<p>
This is some of my keybindings, first, we make some movement enhancement. I find it very useful to use <code>super-k/j</code> to jump by paragraph, it's faster than crawling line by line with <code>C-n/p</code>, next, instead of <code>C-a</code> for moving to beginning of the line, I change it to <code>C-0</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">Custom keybinding</span>
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">Movement and editing</span>
(global-set-key (kbd <span style="color: #50a14f;">"s-j"</span>) 'forward-paragraph)
(global-set-key (kbd <span style="color: #50a14f;">"s-k"</span>) 'backward-paragraph)
(global-set-key (kbd <span style="color: #50a14f;">"C-0"</span>) 'beginning-of-line)
(global-set-key (kbd <span style="color: #50a14f;">"C-o"</span>) (<span style="color: #e45649;">lambda</span> () (interactive) (end-of-line) (newline-and-indent)))
</pre>
</div>

<p>
On MacOS, depends on your keyboard, you can remap the <code>Cmd</code> key to <code>Ctrl</code> or <code>Meta</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq mac-command-modifier 'control)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">or</span>
(setq mac-command-modifier 'meta)
</pre>
</div>

<p>
Also, instead of typing <code>M-x</code> all the time, I bind <code>C-==</code> to <code>helm-M-x</code>, this will let me have a suggestion list of <code>M-x</code> command, and the hand movement is way better than <code>M-x</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(global-set-key (kbd <span style="color: #50a14f;">"C-="</span>) 'helm-M-x)
</pre>
</div>

<p>
Next is some window management keys:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">Window management                               </span>
(global-set-key (kbd <span style="color: #50a14f;">"C-c /"</span>) 'split-window-right)
(global-set-key (kbd <span style="color: #50a14f;">"C-c \\"</span>) 'split-window-below)
(global-set-key (kbd <span style="color: #50a14f;">"C-c l"</span>) 'windmove-right)     
(global-set-key (kbd <span style="color: #50a14f;">"C-c h"</span>) 'windmove-left)      
(global-set-key (kbd <span style="color: #50a14f;">"C-c k"</span>) 'windmove-up)        
(global-set-key (kbd <span style="color: #50a14f;">"C-c j"</span>) 'windmove-down)      
(global-set-key (kbd <span style="color: #50a14f;">"C-c ="</span>) 'balance-windows)    
</pre>
</div>

<p>
For closing window, there's a <code>C-x 0</code> key and it's good enough, so we don't have to change.
</p>

<p>
Now, some other stuff that also helpful:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">Searching</span>
(global-set-key (kbd <span style="color: #50a14f;">"C-x /"</span>) 'helm-projectile-ag)
(global-set-key (kbd <span style="color: #50a14f;">"C-x ."</span>) 'helm-resume)
<span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">Functions</span>
(global-set-key (kbd <span style="color: #50a14f;">"C-."</span>) 'repeat)
(global-set-key (kbd <span style="color: #50a14f;">"C-c f e d"</span>) (<span style="color: #e45649;">lambda</span> () (interactive) (find-file <span style="color: #50a14f;">"~/.emacs.d/init.el"</span>)))
(global-set-key (kbd <span style="color: #50a14f;">"C-c f e R"</span>) (<span style="color: #e45649;">lambda</span> () (interactive) (load-file <span style="color: #50a14f;">"~/.emacs.d/init.el"</span>)))
</pre>
</div>

<p>
From here, we can continue exploring the Emacs keybinding, when in doubt, open this document: <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html#Top">https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html#Top</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org9ef86a1" class="outline-2">
<h2 id="org9ef86a1"><span class="section-number-2">3</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">
<p>
After a day, I've been familiar enough with basic vanilla Emacs. I still miss a lot from Vim/Evil, but I feel much more confident. In fact, I do learn some more interesting Emacs feature, like <code>C-x r t</code> (<code>rectangle-string</code>), which I never tried in <code>evil-mode</code>.
</p>

<p>
The most concerned thing that stop me from switching to vanilla Emacs before is the ergonomic of using <code>hjkl</code>, it seems to be way more convenience than <code>C-n/p/b/f</code>. But tried it for a while, I think it's not that bad. Since it has another benefit, is you don't have to go back and forth from <code>insert</code> and <code>normal</code> mode. You'll feel more freedom.
</p>

<p>
<b>Edit:</b> Oh, and one more thing, I just discovered that macOS has some built-in keybinding for Emacs as well, that mean, we can actually use <code>C-n</code>, <code>C-p</code>,&#x2026; in the textboxes across the OS, including browsers address bar, terminal emulators,&#x2026; needless to say how comfortable it is if you're already familiar with Emacs keybinding.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Huy Tran</p>
<p class="date">Created: 2019-01-19 Sat 00:50</p>
<p class="validation"></p>
</div>
</body>
</html>
